Revit 2024 API
OpenConflictScenario Enumeration
 The kinds of conflicts happened during open.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Since: 2019
Syntax
C#
public enum OpenConflictScenario
Visual Basic
Public Enumeration OpenConflictScenario
Visual C++
public enum class OpenConflictScenario
Members
Member name | Description
Rollback |  Central model is restored to an earlier version.
Relinquished |  Ownership to model elements is relinquished.
OutOfDate |  Model is out of date.
VersionArchived |  Last central version merged into the local model has been archived in the central model.
See Also
Autodesk.Revit.DB Namespace